{
    "title": "Open Source License Chooser",
    "questions-title": "Please answer the following questions:",
    "label-commercial": "1. Do you allow commercial use?",
    "label-modify": "2. Do you allow modifications and derivative works?",
    "label-distribute": "3. Do you allow distribution?",
    "label-sublicense": "4. Do you allow sublicensing?",
    "label-private-use": "5. Do you allow private use?",
    "label-patent-use": "6. Do you want to grant patent use?",
    "submit-btn": "Submit",
    "result-title": "Recommended License:",
    "reset": "Choose Again",
    "footer-text": "© 2023 Open Source License Chooser. This tool is for reference only and does not constitute legal advice.",
    "pleaseSelect": "Please select",
    "yes": "Yes",
    "no": "No",
    "mitLicense": "MIT License",
    "mitDescription": "The MIT License is a permissive license that is short and to the point. It lets people do anything they want with your code as long as they provide attribution back to you and don't hold you liable.",
    "apacheLicense": "Apache License 2.0",
    "apacheDescription": "The Apache License 2.0 is a permissive license similar to the MIT License, but also provides an express grant of patent rights from contributors to users.",
    "gplLicense": "GNU General Public License v3.0",
    "gplDescription": "The GPL is a copyleft license that requires anyone who distributes your code or a derivative work to make the source available under the same terms, and also provides an express grant of patent rights from contributors to users.",
    "ccLicense": "Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported",
    "ccDescription": "This Creative Commons license allows others to download your works and share them with others as long as they credit you, but they can't change them in any way or use them commercially.",
    "bsdLicense": "BSD 2-Clause \"Simplified\" License",
    "bsdDescription": "The BSD 2-Clause license is a permissive license that comes in two variants (2-clause and 3-clause). It allows unlimited redistribution for any purpose as long as its copyright notices and the license's disclaimers of warranty are maintained.",
    "undetermined": "Unable to determine the best license",
    "undeterminedDescription": "Based on your choices, we couldn't determine a single best license. We recommend reviewing more open source licenses or consulting with a legal professional.",
    "learnMore": "Learn more about this license"
}